app/controllers/book_controller.rb

   def list
      @books = Book.all
      @subjects = Subject.all(:select => "id, name")
---
SELECT * FROM `books`
SELECT id, name FROM `subjects`

   def show
      @book = Book.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 1)

   def create
       @book = Book.new(params[:book])
       if @book.save
---
INSERT INTO `books` (`updated_at`, `title`, `price`, `description`, `subject_id`, `created_at`) VALUES('2010-12-23 12:11:22', 'physics', 0.0, 'ghkdsghkkhgdkg\r\ndfgjd;flgjdf;g', 1, '2010-12-23 12:11:22')

   def edit
      @book = Book.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 1)

   def update
     @book = Book.find(params[:id])
        if @book.update_attributes(params[:book])
---
SELECT * FROM `books` WHERE (`books`.`id` = 1)
UPDATE `books` SET `price` = 35.0, `updated_at` = '2010-12-23 12:58:56' WHERE `id` = 1

   def delete
       Book.find(params[:id]).destroy
---
DELETE FROM `books` WHERE `id` = 1
SELECT * FROM `books` WHERE (`books`.`id` = 1)

   def show_subjects
      @subject = Subject.find(params[:id], :include => :books)
---
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT `books`.* FROM `books` WHERE (`books`.subject_id = 1)