app/controllers/subject_controller.rb

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
---
   def show
      @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`name`, `created_at`, `updated_at`) VALUES('', '2011-03-15 12:15:45', '2011-03-15 12:15:45')
---
   def create
      @subject = Subject.new(params[:subject])
      if @subject.save